#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/joshua1571/terraformtest/runs/run-jZALGfdHJgKEWPsN

Waiting for the plan to start...

Terraform v1.0.11
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/b4efc6b3-f0cf-4031-9f5f-17c8486965c9/resourceGroups/myTFResourceGroup]
azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/b4efc6b3-f0cf-4031-9f5f-17c8486965c9/resourceGroups/myTFResourceGroup/providers/Microsoft.Network/virtualNetworks/myTFVnet]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_virtual_network.vnet has been changed
  ~ resource "azurerm_virtual_network" "vnet" {
        id                      = "/subscriptions/b4efc6b3-f0cf-4031-9f5f-17c8486965c9/resourceGroups/myTFResourceGroup/providers/Microsoft.Network/virtualNetworks/myTFVnet"
        name                    = "myTFVnet"
      + tags                    = {}
        # (8 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.example will be created
  + resource "azurerm_linux_virtual_machine" "example" {
      + admin_username                  = "adminuser"
      + allow_extension_operations      = true
      + computer_name                   = (known after apply)
      + disable_password_authentication = true
      + extensions_time_budget          = "PT1H30M"
      + id                              = (known after apply)
      + location                        = "westus2"
      + max_bid_price                   = -1
      + name                            = "example-machine"
      + network_interface_ids           = (known after apply)
      + platform_fault_domain           = -1
      + priority                        = "Regular"
      + private_ip_address              = (known after apply)
      + private_ip_addresses            = (known after apply)
      + provision_vm_agent              = true
      + public_ip_address               = (known after apply)
      + public_ip_addresses             = (known after apply)
      + resource_group_name             = "example-resources"
      + size                            = "Standard_B1ls"
      + virtual_machine_id              = (known after apply)
      + zone                            = (known after apply)

      + admin_ssh_key {
          + public_key = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCzvZkjzezv0hJ3ZgIj5rVurQG3kHDIG0jPcy6mYYHyiS7tOmUutF4c+bDqBQL3mXr+7I31KhQFPvDSrMAx7jAqVDssDG8AimR0sDC0/9J8qqMSmBH+SQXuVdykPAY7B2ix0eGi4VpDcHjAlT5+e9SvDtl4Ifzp3WJAfDka+h748wDZicd4YEf5WzuI4wV6lZ3o+VIVDUH+Esw5PQGMTUlCh0zFSUJUjzd9/ADteD4vrz/s3gId4VfVMGiGoyx5M5iKI1g8WDOk7okU2g71nOkBJ8GlajouQ3kJvHe4+zuVP+y2oXY6YkPDzahRtpcMt0v/ZJF+OrCRbFktT6eWqUWbl0MTtHt0nLzQhz1IP4xcRJVhk8qurkw8jY91mVxseNlahonde6yYfRVRx4Ivy12S+1akuUPR11rRyUgjTJISLubADz7+lRn5RuL1bWKTTsQmFeyHxjIAZ8sOqVs/+2j9jSjkIic5wXXw2BcQNj0iF8gnAtqBHVV/f8X5167vm8M= jrh@JRH-MacBook-Pro"
          + username   = "adminuser"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "20.04-LTS"
          + version   = "latest"
        }
    }

  # azurerm_network_interface.example will be created
  + resource "azurerm_network_interface" "example" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "westus2"
      + mac_address                   = (known after apply)
      + name                          = "example-nic"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "example-resources"
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

  # azurerm_resource_group.example will be created
  + resource "azurerm_resource_group" "example" {
      + id       = (known after apply)
      + location = "westus2"
      + name     = "example-resources"
    }

  # azurerm_subnet.example will be created
  + resource "azurerm_subnet" "example" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.0.2.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "internal"
      + resource_group_name                            = "example-resources"
      + virtual_network_name                           = "example-network"
    }

  # azurerm_virtual_network.example will be created
  + resource "azurerm_virtual_network" "example" {
      + address_space         = [
          + "10.0.0.0/16",
        ]
      + dns_servers           = (known after apply)
      + guid                  = (known after apply)
      + id                    = (known after apply)
      + location              = "westus2"
      + name                  = "example-network"
      + resource_group_name   = "example-resources"
      + subnet                = (known after apply)
      + vm_protection_enabled = false
    }

Plan: 5 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @joshua1571, Action: `pull_request`*